Messwerte/Archiv/Raw/apache_benchmark_repeat35/min/kata/python-tornado/target_count_13/repeat_7/2.txt
2020/01/21 11:47:28 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8002/
2020/01/21 11:47:58 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 13061 requests
Server Software:        TornadoServer/4.5.3
Server Hostname:        192.168.3.100
Server Port:            8002
Document Path:          /
Document Length:        1000 bytes
Concurrency Level:      100
Time taken for tests:   30.000 seconds
Complete requests:      13061
Failed requests:        0
Total transferred:      15634017 bytes
HTML transferred:       13061000 bytes
Requests per second:    435.37 [#/sec] (mean)
Time per request:       229.692 [ms] (mean)
Time per request:       2.297 [ms] (mean, across all concurrent requests)
Transfer rate:          508.92 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.1      0      29
Processing:     2  227 181.5    158     823
Waiting:        2  227 181.0    158     823
Total:          6  228 181.9    159     824
Percentage of the requests served within a certain time (ms)
  50%    159
  66%    353
  75%    388
  80%    404
  90%    431
  95%    500
  98%    717
  99%    765
 100%    824 (longest request)
2020/01/21 11:47:58 Matched stat line [Connect:        0    1   2.1      0      29 Connect 0 1 2.1 0 29]
2020/01/21 11:47:58 Matched stat line [Processing:     2  227 181.5    158     823 Processing 2 227 181.5 158 823]
2020/01/21 11:47:58 Matched stat line [Waiting:        2  227 181.0    158     823 Waiting 2 227 181.0 158 823]
2020/01/21 11:47:58 Matched stat line [Total:          6  228 181.9    159     824 Total 6 228 181.9 159 824]
2020/01/21 11:47:58 Matched percentline [  50%    159 50 159]
2020/01/21 11:47:58 Matched percentline [  66%    353 66 353]
2020/01/21 11:47:58 Matched percentline [  75%    388 75 388]
2020/01/21 11:47:58 Matched percentline [  80%    404 80 404]
2020/01/21 11:47:58 Matched percentline [  90%    431 90 431]
2020/01/21 11:47:58 Matched percentline [  95%    500 95 500]
2020/01/21 11:47:58 Matched percentline [  98%    717 98 717]
2020/01/21 11:47:58 Matched percentline [  99%    765 99 765]
2020/01/21 11:47:58 Matched percentline [ 100%    824 100 824]
{"connect":{"max":29,"mean":1,"median":0,"min":0,"stdDev":2.0999999046325684},"percentiles":{"100":824,"50":159,"66":353,"75":388,"80":404,"90":431,"95":500,"98":717,"99":765},"processing":{"max":823,"mean":227,"median":158,"min":2,"stdDev":181.5},"total":{"max":824,"mean":228,"median":159,"min":6,"stdDev":181.89999389648438},"waiting":{"max":823,"mean":227,"median":158,"min":2,"stdDev":181}}